src/services/saml/aaservice.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions targetNamespace="http://www.nordugrid.org/schemas/aa"
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
 xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
 xmlns:samlp="urn:oasis:names:tc:SAML:2.0:protocol"
 xmlns:aa="http://www.nordugrid.org/schemas/aa">

  <wsdl:message name="aaRequest">
    <wsdl:part name="aaRequest" element="samlp:AttributeQuery"/>
  </wsdl:message>

  <wsdl:message name="aaResponse">
    <wsdl:part name="aaResponse" element="samlp:Response"/>
  </wsdl:message>

  <wsdl:portType name="aa">
    <wsdl:operation name="aa">
      <wsdl:input name="aaRequest"
        message="aa:aaRequest"/>
      <wsdl:output name="aaResponse"
        message="aa:aaResponse"/>
    </wsdl:operation>
  </wsdl:portType>

  <wsdl:binding name="aa" type="aa:aa">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="aa">
      <soap:operation soapAction="aa_service"/>
      <wsdl:input name="aaRequest">
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output name="aaResponse">
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>

  <wsdl:service name="aa">
    <wsdl:port name="aa" binding="aa:aa">
      <soap:address location="http://localhost:80"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>
