public/xmlSample/AttrQueryRequest.xml

<?xml version="1.0" encoding="UTF-8"?><soap11:Envelope xmlns:soap11="http://schemas.xmlsoap.org/soap/envelope/"><soap11:Body><saml2p:AttributeQuery xmlns:saml2p="urn:oasis:names:tc:SAML:2.0:protocol" ID="bcf2b631-f255-4b97-8ef3-4656d83b8edb" IssueInstant="2012-04-25T15:07:44.374Z" Version="2.0"><saml2:Issuer xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion" Format="urn:oasis:names:tc:SAML:2.0:nameid-format:entity">http://app.one.com/shibboleth</saml2:Issuer><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#bcf2b631-f255-4b97-8ef3-4656d83b8edb"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>SXQnHEiDpDyGZCK2AzS3MatmOl0=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>MIoH6kw8xgtxICDU87FoW9eb7JqkQDCCLvAkqybjz1b8T1th9B25eeN2A3fYjQYb76Q+qoSHEzNcWiIe7wJOCIItQFiWNbx7DLkVA8dhNdMYey0XjaKB8l8RZWTqLUjHgfjbidbE/tAavvqOM4UX6n8jtyoXDZWo8ppwKBCSG2c=</ds:SignatureValue><ds:KeyInfo><ds:X509Data><ds:X509Certificate>MIIB+jCCAWOgAwIBAgIJANJCfvj7xyyBMA0GCSqGSIb3DQEBBQUAMBYxFDASBgNVBAMMC2FwcC5v
bmUuY29tMB4XDTEyMDQxMzE3NTkwMloXDTIyMDQxMTE3NTkwMlowFjEUMBIGA1UEAwwLYXBwLm9u
ZS5jb20wgZ8wDQYJKoZIhvcNAQEBBQADgY0AMIGJAoGBAKlvLThMgBYdEbl9Cjbov+hx2LzNT8yo
/TX/I6M/keDOdReibXyRdJQFLRIU1Fgyg4aoSVG0XRB7e4qmci1SPRj92NZvJfgFtwWN0UXBiU4V
RVRGb1YHMElThN8PR/PuODwR8MnyB4uVbht3P+adFTx1DVIMzydmJyvebTXlxEbTAgMBAAGjUDBO
MB0GA1UdDgQWBBQt+qT7hEmxVOLyZiH6fCiKtlDwTzAfBgNVHSMEGDAWgBQt+qT7hEmxVOLyZiH6
fCiKtlDwTzAMBgNVHRMEBTADAQH/MA0GCSqGSIb3DQEBBQUAA4GBACEJ84us3IsfwM96RM5avFn3
g6pv7T8vCk8ngVvq+ajBP1R8lpwQR5aMv1iHbjOySONKyiQBqAr7Ebh48lH1ewtFI5haYJqbNm/1
mXaGnc0QKBWITViGagmQ09z4h97WqwCzr0SXfSutuHD78djIpwFyBpamIvBHdhqp+F/TwJnf</ds:X509Certificate></ds:X509Data></ds:KeyInfo></ds:Signature><saml2:Subject xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion"><saml2:NameID>_3f374a95547057781335e939180a419a</saml2:NameID></saml2:Subject></saml2p:AttributeQuery></soap11:Body></soap11:Envelope>